blog/20200128.org
#+TITLE: Switching to New Website
#+DATE: <2020-01-28 Tue>
#+AUTHOR: Cem Keylan

In case you haven't seen it before, this website was powered by [[http://werc.cat-v.org][werc]]. And even
though I liked it really much, it was too powerful for a small website like
this.

So I have decided to reimplement this website with my own static generation
scripts. The source will probably be on [[https://git.carbslinux.org/website/log.html][its git repository]] when I decide to
publish the website.

The generation requires Plan9 programs, although I have used them just for my
enthusiasm. I have built the site with a combination of mk (instead of make),
rc, and POSIX sh. I am not yet exactly familiar with rc, but I will replace the
shell scripts when I feel like I can.
