docs/blog/20200128.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-02-02 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Switching to New Website</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cem Keylan">
<link rel="stylesheet" type="text/css" href="/style.css">
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar">
    <a href="/" class=navbartitle>Carbs Linux</a>

    <label for="hamburger">&#9776;</label>
    <input type="checkbox" id="hamburger" />
    <ul id=navbarlist>
        <li><a href="/" title="Home Page">Home</a></li>
        <li><a href="//git.carbslinux.org" title="Git Repository">Git</a></li>
        <li><a href="/download.html" title="Download Carbs Linux">Download</a></li>
        <li><a href="/blog" title="Blog Posts">Blog</a></li>
        <li><a href="/install.html" title="Installation Instructions">Installation</a></li>
        <li><a href="/docs.html" title="Documentation">Docs</a></li>
    </ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">Switching to New Website</h1>
<p class="subtitle">posted on 2020-01-28</p>
</header><p>
In case you haven't seen it before, this website was powered by <a href="http://werc.cat-v.org">werc</a>. And even
though I liked it really much, it was too powerful for a small website like
this.
</p>

<p>
So I have decided to reimplement this website with my own static generation
scripts. The source will probably be on <a href="https://git.carbslinux.org/website/log.html">its git repository</a> when I decide to
publish the website.
</p>

<p>
The generation requires Plan9 programs, although I have used them just for my
enthusiasm. I have built the site with a combination of mk (instead of make),
rc, and POSIX sh. I am not yet exactly familiar with rc, but I will replace the
shell scripts when I feel like I can.
</p>
</div>
<div id="postamble" class="status">
<footer>
    <p>Linux&reg; is a registered trademark of Linus Torvalds</p>
    <p>Copyright &copy; 2019-2021 Cem Keylan</p>
</footer>
</div>
</body>
</html>
